# Прочитайте текстовый файл: loco_11_corr.tsv.
# Описание полей в файле: Loco_11_метаданные.docx
# Проведите анализ аномалий.
# Обоснуйте выбор инструмента выявления аномалий, проведите анализ аномалий, обоснуйте возможность использования всего объема данных для решения задач машинного обучения. В случае если это не возможно, разделите исходные данные на выборки.
import Anomaly

# Прочитайте текстовый файл: loco_11_corr.tsv
# Описание полей в файле: Loco_11_метаданные.docx
# Проведите разведочный анализ данных. Результаты представьте в виде:
# - фрейма данных и текстового описания. Текст и фрейм должны генерироваться по итогу выполнения кода.
# - Графического сопровождения, логичного для набора данных (не менее 3, исходя из данных)
import EDA

# Считайте файл “Информация о пассажирах.xlsx”
# Постройте кластеризацию следующими методами:
# - k-means (при выборе количества кластеров использовать -метод elbow)
# - dbscan
# Выбор переменных для кластеризации должен быть продиктован здравым смыслом и содержать не менее 5 переменных.
# Построить график в параллельных координатах для обеих кластеризаций (k-means\dbscan).
# Построить кластеризации kmeans\dbscan для двух и трёх переменных и показать на двумерном\трёхмерном графике результаты.
import KLASTER

__add__ = ['Anomaly', 'EDA', 'KLASTER']