Repository: pypi-data/pypi-mirror-342
Catalog: packages/fittings/fittings-2.1.1.tar.gz/fittings-2.1.1/fittings/locale/*/LC_MESSAGES/django.po
Languages: es, fr_fr, ja, ru

source: Add Doctrine
es: Añadir doctrina
fr_fr: Ajouter Doctrine
ja: ドクトリンを追加
ru: Добавить доктрину

source: New Doctrine
es: Nueva doctrina
fr_fr: Nouvelle doctrine
ja: 新しいドクトリン
ru: Новая доктрина

source: Doctrine Name
es: Nombre de la doctrina
fr_fr: Nom de la doctrine
ja: ドクトリンの名前
ru: Имя доктрины

source: Doctrine Description
es: Descripción de la doctrina
fr_fr: Description de la doctrine
ja: ドクトリンの説明
ru: Описание доктрины

source: Select Fits
es: Seleccionar equipamientos
ja: Fitを選択
ru: Выбрать оснащения

source: Select Doctrine Icon
es: Seleccionar el icono de la doctrina
fr_fr: Sélectionner l'icône de Doctrine
ja: ドクトリンアイコン
ru: Выбрать иконку доктрины

source: If you do not see the ship type that you would like to use for the icon, add a fit that uses that ship type and try again.
es: Si no ves el tipo de nave que te gustaría utilizar para el icono, añade un equipamiento que utilice ese tipo de nave e inténtalo de nuevo.
fr_fr: Si vous ne voyez pas le type de vaisseau que vous souhaitez utiliser pour l'icône, ajoutez une configuration qui utilise ce vaisseau de navire et réessayez.
ja: アイコンに使用したい艦種が表示されない場合は、対応する艦種のfitを追加してください。
ru: Если вы не видите тип корабля, который хотели бы использовать в качестве иконки, то добавьте оснащение, использующее данный тип корабля, и попробуйте снова.

source: Submit
es: Enviar
fr_fr: Soumettre
ja: 送信
ru: Отправить

source: Search
ja: 検索

source: Add Fit
es: Añadir equipamiento
fr_fr: Ajouter une configuration
ja: Fitを追加
ru: Добавить оснащение

source: Add Fitting
es: Añadir equipamiento
fr_fr: Ajouter une configuration
ja: Fitを追加
ru: Оснастить

source: Description
es: Descripción
fr_fr: Descriptif
ja: 説明
ru: Описание

source: Toggle navigation
es: Alternar navegación
fr_fr: Afficher la navigation
ja: 表示切替
ru: Переключить навигацию

source: Fittings and Doctrines
es: Equipamientos y doctrinas
fr_fr: Configurations et doctrines
ja: Fit&ドクトリン
ru: Оснащения и доктрины

source: View All Doctrines
ja: すべてのドクトリン

source: View All Fits
es: Ver todos los equipamientos
fr_fr: Voir toute les configurations
ja: すべてのFit
ru: Просмотр всех оснащений

source: View All Categories
es: Ver todas las categorías
fr_fr: Afficher toutes les catégories
ja: すべてのカテゴリ
ru: Просмотр всех категорий

source: Doctrine
es: Doctrina
ja: ドクトリン
ru: Доктрина

source: Category
es: Categoría
fr_fr: Catégorie
ja: カテゴリ
ru: Категория

source: Add Category
es: Añadir categoría
fr_fr: Ajouter une catégorie
ja: カテゴリを追加
ru: Добавить категорию

source: New Category
es: Nueva categoría
fr_fr: Nouvelle catégorie
ja: 新しいカテゴリ
ru: Новая категория

source: Category Name
es: Nombre de la categoría
fr_fr: Nom de la catégorie
ja: カテゴリ名
ru: Имя категории

source: Category Color
es: Color de la categoría
fr_fr: Couleur de la catégorie
ja: カテゴリの色
ru: Цвет категории

source: Select Groups
es: Seleccionar grupos
fr_fr: Sélectionnez les groupes
ja: グループを選択
ru: Выбрать группы

source: Only selected groups will have access to fittings and doctrines in this category. If no groups are selected the category will be visible to all with fittings module access.
es: Sólo los grupos seleccionados tendrán acceso a los equipamientos y doctrinas de esta categoría. Si no se selecciona ningún grupo, la categoría será visible para todos los que tengan acceso al módulo de accesorios.
fr_fr: Seuls les groupes sélectionnés auront accès aux accessoires et aux doctrines de cette catégorie. Si aucun groupe n'est sélectionné, la catégorie sera visible par tous ceux qui ont accès au module de configuration.
ja: 選択されたグループのみが、このカテゴリのFitやドクトリンにアクセスできます。グループが選択されていない場合は、Fit・モジュールへのアクセス権を持つすべての人が閲覧できます。
ru: Только выбранные группы будут иметь доступ к оснащениям и доктринам в этой категории. Если не выбрано ни одной группы, то категория будет видима всем, у кого есть доступ к модулю оснащения.

source: Select Doctrines
es: Seleccionar doctrinas
fr_fr: Sélectionnez les doctrines
ja: ドクトリンを選択
ru: Выбрать доктрины

source: Select Value
ja: 値を選択

source: No Results
ja: 該当なし

source: Dashboard
es: Página principal
fr_fr: Tableau de bord
ja: ダッシュボード
ru: Инфопанель

source: Oh No!
ja: おっと！

source: Success!
ja: 成功！

source: Doctrine List
es: Lista de doctrinas
fr_fr: Liste des doctrines
ja: ドクトリンの一覧
ru: Список доктрин

source: Doctrines
es: Doctrinas
ja: ドクトリン
ru: Доктрины

source: No Doctrines Found
es: No se han encontrado doctrinas
fr_fr: Aucune doctrine trouvée
ja: ドクトリンが見つかりません
ru: Доктрины не найдены

source: Name
es: Nombre
fr_fr: Nom
ja: 名前
ru: Имя

source: Categories
es: Categorías
fr_fr: Catégories
ja: カテゴリ
ru: Категории

source: Ships
es: Naves
fr_fr: Vaisseaux
ja: 艦船
ru: Корабли

source: Edit Category
es: Editar categoía
fr_fr: Modifier la catégorie
ja: カテゴリを編集
ru: Править категорию

source: Edit Doctrine
es: Editar doctrina
fr_fr: Modifier la doctrine
ja: ドクトリンを編集
ru: Править доктрину

source: Current Icon
es: Icono actual
fr_fr: Icône actuelle
ja: 現在のアイコン
ru: Текущая иконка

source: Update Fitting
es: Actualizar equipamiento
fr_fr: Mettre à jour la configuration
ja: Fitを更新
ru: Обновить оснащение

source: Category List
es: Lista de categorías
fr_fr: Liste des catégories
ja: カテゴリの一覧
ru: Список категорий

source: Fits
es: Equipamientos
fr_fr: Configurations
ja: Fit
ru: Оснащения

source: No Categories Found
es: No se han encontrado categorías
fr_fr: Aucune catégorie trouvée
ja: カテゴリが見つかりません
ru: Категории не найдены

source: Doctrines Assigned
es: Doctrinas asignadas
fr_fr: Doctrines assignées
ja: 割り当てられたドクトリン
ru: Назначенные доктрины

source: Fittings Assigned
es: Equipamientos asignados
fr_fr: Configurations assignés
ja: 割り当てられたfit
ru: Назначенные оснащения

source: Groups Assigned
es: Grupos asignados
fr_fr: Groupes assignés
ja: 割り当てられたグループ
ru: Назначенные группы

source: View Category
es: Ver categoría
fr_fr: Afficher la catégorie
ja: カテゴリを見る
ru: Просмотр категории

source: Delete Category
es: Eliminar categoría
fr_fr: Supprimer la catégorie
ja: カテゴリを削除
ru: Удалить категорию

source: *Note: Fit counts may be inaccurate as fits marked independently of doctrines may be counted more than once.
es: *Nota: El recuento de equipamientos puede ser inexacto, ya que los equipamientos marcados independientemente de las doctrinas pueden contarse más de una vez.
ja: *注意: Fitの数は、ドクトリンごとに同じものが複数回カウントされるため、正確でない場合が あります。
ru: * Заметка: количество оснащений может быть не точным, поскольку оснащения, отмеченные независимо от доктрин, могут быть посчитаны более одного раза.

source: Fit List
es: Lista de equipamientos
fr_fr: Liste des configurations
ja: Fit一覧
ru: Список оснащений

source: No Fits Found
es: No se han encontrado equipamientos
fr_fr: la configuration n'a pas été trouvé
ja: Fitが見つかりません
ru: Оснащений не найдено

source: Ship Type
es: Tipo de nave
fr_fr: Type de vaisseaux
ja: 艦船の種類
ru: Тип корабля

source: Groups
es: Grupos
fr_fr: Groupes
ja: グループ
ru: Группы

source: Category is public
es: La categoría es pública
fr_fr: La catégorie est publique
ja: 公開カテゴリです
ru: Категория является публичной

source: Are you sure?
es: ¿Estás seguro?
fr_fr: Êtes-vous sûr?
ja: 本当に実行しますか？
ru: Вы уверены?

source: Are you sure you wish to delete this doctrine?
es: ¿Está seguro de que desea eliminar esta doctrina?
fr_fr: Êtes-vous sûr de vouloir supprimer cette doctrine?
ja: 本当にドクトリンを削除しますか？
ru: Вы уверены что хотите удалить эту доктрину?

source: This action is permanent.
es: Esta acción es permanente.
fr_fr: Cette action est permanente.
ja: この操作は半永久的です。
ru: Это действие необратимо.

source: No - Close
es: No - Cerrar
fr_fr: Non - Fermer
ja: いいえ - 閉じる
ru: Нет — закрыть

source: Yes - Delete
es: Sí - Eliminar
fr_fr: Oui - Supprimer
ja: はい - 削除
ru: Да — удалить

source: Doctrine Information
es: Información sobre la doctrina
fr_fr: Informations sur la doctrine
ja: ドクトリンの情報
ru: Информация доктрины

source: Delete Doctrine
es: Eliminar la doctrina
fr_fr: Supprimer la doctrine
ja: ドクトリンを削除
ru: Удалить доктрину

source: Created
es: Creado
fr_fr: Créé
ja: 作成
ru: Создано

source: Last Updated
es: Última actualización
fr_fr: Dernière mise à jour
ja: 最終更新
ru: Последнее обновление

source: Doctrine Fits
es: Equipamientos de doctrina
ja: ドクトリンのFit
ru: Оснащения доктрины

source: Are you sure you wish to delete this fit?
es: ¿Está seguro de que desea eliminar este equipamiento?
ja: 本当にFitを削除しますか？
ru: Вы уверены что хотите удалить это оснащение?

source: Close
es: Cerrar
fr_fr: Fermer
ja: 閉じる
ru: Закрыть

source: Fit Information
es: Información del equipamiento
fr_fr: Informations sur la configuration
ja: Fitの情報
ru: Информация оснащения

source: Delete Fit
es: Eliminar equipamiento
fr_fr: Supprimer la configuration
ja: Fitを削除
ru: Удалить оснащение

source: Edit/Update Fit
es: Editar/Actualizar equipamiento
fr_fr: Modifier/mettre à jour la configuration
ja: Fitを編集/更新
ru: Править/обновить оснащение

source: Hull
es: Estructura
ja: 艦船
ru: Корпус

source: Fitting Notes
es: Notas del equipamiento
ja: Fitの備考
ru: Заметки оснащения

source: Save to EVE
ja: EVEに保存

source: Copy Buy All
es: Copiar Comprar todo
fr_fr: Copier tout acheter
ja: ショッピングリストをコピー
ru: Копировать "Купить всё"

source: Copy Fit (EFT)
es: Copiar equipamiento (EFT)
ja: クリップボードにコピー(EFT)
ru: Копировать оснащение (EFT)

source: SubSystems
es: Subsistemas
fr_fr: Sous-systèmes
ja: サブシステム
ru: Подсистемы

source: High Slots
es: Ranura superior
ja: ハイスロット
ru: Верхние слоты

source: No High Slot Items
es: Ranura superior vacía
ja: ハイスロットが空です
ru: Нет предметов для верхних слотов

source: Medium Slots
es: Ranura intermedia
ja: ミディアムスロット
ru: Средние слоты

source: No Medium Slot Items
es: Ranura intermedia vacía
ja: ミディアムスロットが空です
ru: Нет предметов для средних слотов

source: Low Slots
es: Ranura inferior
ja: ロースロット
ru: Нижние слоты

source: No Low Slot Items
es: Ranura inferior vacía
ja: ロースロットが空です
ru: Нет предметов для нижних слотов

source: Rig Slots
es: Ranura de complemento
ja: リグスロット
ru: Тюнинг слоты

source: No Rig Slot Items
es: Ranura de complemento vacía
ja: リグスロットが空です
ru: Нет предметов для тюнинг слотов

source: Service Slots
es: Ranura de servicio
ja: サービススロット
ru: Сервисные слоты

source: Fighter Tubes
es: Tubos de Lanzamiento de Cazas
ja: 射出チューブ
ru: Слоты файтеров

source: Cargo Bay
es: Bodega
ja: カーゴベイ
ru: Грузовой отсек

source: Drone Bay
es: Muelle de drones
ja: ドローンベイ
ru: Отсек дронов

source: Fighter Bay
es: Plataforma para cazas
ja: ファイターベイ
ru: Отсек файтеров

source: Fitting
es: Equipamiento
fr_fr: Configuration
ru: Оснащение

source: Fit
es: Equipamiento
fr_fr: Configuration
ru: Оснащение

source: Fittings
es: Equipamientos
fr_fr: Configurations
ru: Оснащения
