# Проведите анализ текстовых сущестной (решите задачу NER). Результат работы программы должен выглядеть:
#
#
#
# Реализуйте функцию, которую можно дать на вход text, а она вернет размеченный текст.
# Дополнительное задание:
# улучшите функцию, добавь в качестве переменной тип именной сущности. Результатом отработки функции должен быть список частей текста, соответствующей сущности в именительном падеже.
# Пример
# print(mu_ner(text, “ORG”) )
# [Абаканский линейный отдел, МВД ]
from .NER import ner_markup

# Прочитайте текстовый файл: (Стругацкие) Тестовая_2 вместе.txt. Проведите векторизацию текста используя различные методы, в том числе предобученные модели, word2vec, Skip-Gram
import vectorization

__add__ = ['ner_markup', 'vectorization']