# -*- coding=utf-8 -*-
notes_data = [
    ("yuanbian-199*****118", "该课程对我帮助很大， 我曾经在B站上看过很多免费课程，但是那些所谓的免费课程不过是引流课，"
                             "内容不全，讲解枯燥，而且咨询反馈很不及时，直到我看到了猿变课程， 猿变课程给我一种全新的感觉。"),
    ("yuanbian-188*****336",
     "猿变课程给我最大的感受就是平哥解答问题特别及时，而且不厌其烦的引导我思考，直到我真正的领悟。"),
    ("yuanbian-188*****735", "猿变课程真是太棒了， 尤其猿变课程提供的在线练习， 可以很快帮助我将从视频学习的理论转化为自己解决"
                             "问题的实际能力。"),
    ("yuanbian-170*****165", "我还是一名学生，因为要做毕业设计， 虽然课程也安排了Python内容，但是内容太浅，"
                             "我想开发一个基于open ai的应用，但是效果一直不理想，但是平哥仅仅指点了思路，很快就解决了。"),
    ("yuanbian-171*****691", "这门课程真的太棒了！我之前一直苦于找不到一个真正能够解答我的问题的地方，但是这个课程的解"
                             "答疑问服务简直太及时了。"),
    ("yuanbian_152*****677", "真的很棒，我学习爬虫后，很快就通过爬取抖音视频赚回了课程费"),
    ("yuanbian-189*****777", "我购买这门课程已经两年了，我仍然能够享受它的所有优势。非常好的价值提供。"),
    ("yuanbian-156*****171", "这门课程的内容非常丰富，完全符合企业现在对Python编程的需求。我学到了很多实际应用的知识。"),
    ("yuanbian-170*****183", "他们提供的在线训练平台是如此强大！我能够通过它快速掌握课程的内容，真是太方便了。"),
    ("yuanbian_137*****435", "我是一名女生，大学学的是计算机，又在这里学习了数据分析课程，现在已经成功入职阿里"),
    ("yuanbian_130*****776", "这个课程的解答疑问比其他课程都要快，我问了一个问题，几分钟后就收到了答复。真是太有效率了！"),
    ("yuanbian_151*****305", "我非常喜欢这个课程的有效期为两年，这让我有足够的时间来复习和巩固所学的知识。"),
    ("yuanbian_133*****394", "这个课程提供的资料非常齐全，我现在几乎可以应对任何Python编程的项目了。"),
    ("yuanbian_173*****332", "在线训练平台真是太好用了！里面有很多有趣的编程项目，让学习变得更加有趣和互动。"),
    ("yuanbian_189*****506", "这门课程的课程内容真的很深入，他们讲解的每一个概念和技巧都非常清晰易懂。"),
    ("yuanbian_153*****168", "我很喜欢这门课程的实践部分，他们提供了很多编程练习和项目，让我有机会真正应用所学的知识。")]
